qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3/stm32f3xx_hal_hrtim.c
     (#) If the HRTIM timer operates in simple mode:
        (##)Simple time base: HAL_HRTIM_SimpleBaseStart(),HAL_HRTIM_SimpleBaseStop(),
                  HAL_HRTIM_SimpleBaseStart_IT(),HAL_HRTIM_SimpleBaseStop_IT(), 
                  HAL_HRTIM_SimpleBaseStart_DMA(),HAL_HRTIM_SimpleBaseStop_DMA(). 
        (##)Simple output compare: HAL_HRTIM_SimpleOCChannelConfig(),
                  HAL_HRTIM_SimpleOCStart(),HAL_HRTIM_SimpleOCStop(),
                  HAL_HRTIM_SimpleOCStart_IT(),HAL_HRTIM_SimpleOCStop_IT(),
                  HAL_HRTIM_SimpleOCStart_DMA(),HAL_HRTIM_SimpleOCStop_DMA(),
        (##)Simple PWM output: HAL_HRTIM_SimplePWMChannelConfig(),
                  HAL_HRTIM_SimplePWMStart(),HAL_HRTIM_SimplePWMStop(),
                  HAL_HRTIM_SimplePWMStart_IT(),HAL_HRTIM_SimplePWMStop_IT(),
                  HAL_HRTIM_SimplePWMStart_DMA(),HAL_HRTIM_SimplePWMStop_DMA(),
        (##)Simple input capture: HAL_HRTIM_SimpleCaptureChannelConfig(),
                  HAL_HRTIM_SimpleCaptureStart(),HAL_HRTIM_SimpleCaptureStop(),
                  HAL_HRTIM_SimpleCaptureStart_IT(),HAL_HRTIM_SimpleCaptureStop_IT(),
                  HAL_HRTIM_SimpleCaptureStart_DMA(),HAL_HRTIM_SimpleCaptureStop_DMA().
        (##)Simple one pulse: HAL_HRTIM_SimpleOnePulseChannelConfig(),
                  HAL_HRTIM_SimpleOnePulseStart(),HAL_HRTIM_SimpleOnePulseStop(),
                  HAL_HRTIM_SimpleOnePulseStart_IT(),HAL_HRTIM_SimpleOnePulseStop_It().

     (#) If the HRTIM timer operates in waveform mode:
        (##)Completes waveform timer configuration
                (+++)HAL_HRTIM_WaveformTimerConfig(): configuration of a HRTIM
                     timer operating in wave form mode mainly consists in:
                        - Enabling the HRTIM timer interrupts and DMA requests,
                        - Enabling the half mode for the HRTIM timer,
                        - Defining how the HRTIM timer reacts to external
                          synchronization input,
                        - Enabling the push-pull mode for the HRTIM timer,
                        - Enabling the fault channels for the HRTIM timer,
                        - Enabling the deadtime insertion for the HRTIM timer,
                        - Setting the delayed protection mode for the HRTIM timer
                          (source and outputs on which the delayed protection are applied),
                        - Specifying the HRTIM timer update and reset triggers,
                        - Specifying the HRTIM timer registers update policy (preload enabling, …).
                (+++)HAL_HRTIM_TimerEventFilteringConfig(): configures external 
                     event blanking and windowingcircuitry of a HRTIM timer:
                        - Blanking:  to mask external events during a defined 
                          time period
                        - Windowing:  to enable external events only during
                          a defined time period
                (+++)HAL_HRTIM_DeadTimeConfig(): configures the deadtime insertion
                     unit for a HRTIM timer. Allows to generate a couple of
                     complementary signals from a single reference waveform, 
                     with programmable delays between active state.
                (+++)HAL_HRTIM_ChopperModeConfig(): configures the parameters of
                     the high-frequency carrier signal added on top of the timing
                     unit output. Chopper mode can be enabled or disabled for each
                     timer output separately (see  HAL_HRTIM_WaveformOutputConfig()).
                (+++)HAL_HRTIM_BurstDMAConfig(): configures the burst DMA burst 
                     controller. Allows having multiple HRTIM registers updated
                     with a single DMA request. The burst DMA operation is started
                     by calling HAL_HRTIM_BurstDMATransfer().
                (+++)HAL_HRTIM_WaveformCompareConfig():configures the compare unit
                     of a HRTIM timer. This operation consists in setting the
                     compare value and possibly specifying the auto delayed mode
                     for compare units 2 and 4 (allows to have compare events
                     generated relatively to capture events). Note that when auto
                     delayed mode is needed, the capture unit associated to the
                     compare unit must be configured separately.
                (+++)HAL_HRTIM_WaveformCaptureConfig(): configures the capture unit
                     of a HRTIM timer. This operation consists in specifying the
                     source(s)  triggering the capture (timer register update event,
                     external event, timer output set/reset event, other HRTIM
                     timer related events). 
                (+++)HAL_HRTIM_WaveformOutputConfig(): configuration HRTIM timer
                     output manly consists in: 
                        - Setting the output polarity (active high or active low),
                        - Defining the set/reset crossbar for the output, 
                        - Specifying the fault level (active or inactive) in IDLE
                          and FAULT states.,
        (##)Set waveform timer output(s) level
                (+++)HAL_HRTIM_WaveformSetOutputLevel(): forces the output to its
                     active or inactive level. For example, when deadtime insertion 
                     is enabled it is necessary to force the output level by software
                     to have the outputs in a complementary state as soon as the RUN mode is entered.
        (##)Enable/Disable waveform timer output(s)
                (+++)HAL_HRTIM_WaveformOutputStart(),HAL_HRTIM_WaveformOutputStop().
        (##)Start/Stop waveform HRTIM timer(s). 
                (+++)HAL_HRTIM_WaveformCounterStart(),HAL_HRTIM_WaveformCounterStop(),
                (+++)HAL_HRTIM_WaveformCounterStart_IT(),HAL_HRTIM_WaveformCounterStop_IT(),
                (+++)HAL_HRTIM_WaveformCounterStart()_DMA,HAL_HRTIM_WaveformCounterStop_DMA(),

        (##)Burst mode controller enabling:
                (+++)HAL_HRTIM_BurstModeCtl(): activates or de-activates the 
                     burst mode controller.

