qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3/stm32f3xx_hal_hrtim.c
        (##)Some HRTIM operations can be triggered by software:
                (+++)HAL_HRTIM_BurstModeSoftwareTrigger(): calling this function 
                     trigs the burst operation.
                (+++)HAL_HRTIM_SoftwareCapture(): calling this function trigs the 
                     capture of the HRTIM timer counter.
                (+++)HAL_HRTIM_SoftwareUpdate(): calling this function trigs the 
                     update of the pre-loadable registers of the HRTIM timer ()
                (+++)HAL_HRTIM_SoftwareReset():calling this function resets the 
                     HRTIM timer counter.

        (##)Some functions can be used anytime to retrieve HRTIM timer related 
            information
                (+++)HAL_HRTIM_GetCapturedValue(): returns actual value of the
                     capture register of the designated capture unit.
                (+++)HAL_HRTIM_WaveformGetOutputLevel(): returns actual level
                     (ACTIVE/INACTIVE) of the designated timer output.
                (+++)HAL_HRTIM_WaveformGetOutputState():returns actual state
                     (IDLE/RUN/FAULT) of the designated timer output.
                (+++)HAL_HRTIM_GetDelayedProtectionStatus():returns actual level 
                     (ACTIVE/INACTIVE) of the designated output when the delayed
                      protection was triggered.
                (+++)HAL_HRTIM_GetBurstStatus(): returns the actual status
                     (ACTIVE/INACTIVE) of the burst mode controller.
                (+++)HAL_HRTIM_GetCurrentPushPullStatus(): when the push-pull mode
                     is enabled for the HRTIM timer (see HAL_HRTIM_WaveformTimerConfig()),
                     the push-pull indicates on which output the signal is currently 
                     active (e.g signal applied on output 1 and output 2 forced
                     inactive or vice versa). 
                (+++)HAL_HRTIM_GetIdlePushPullStatus(): when the push-pull mode
                     is enabled for the HRTIM timer (see HAL_HRTIM_WaveformTimerConfig()),
                     the idle push-pull  status indicates during which period the
                     delayed protection request occurred (e.g. protection occurred
                     when the output 1 was active and output 2 forced inactive or
                     vice versa).

        (##)Some functions can be used anytime to retrieve actual HRTIM status
                (+++)HAL_HRTIM_GetState(): returns actual HRTIM instance HAL state.
  
  @endverbatim

  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************  
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/** @addtogroup STM32F3xx_HAL_Driver
  * @{
  */

#ifdef HAL_HRTIM_MODULE_ENABLED

#if defined(STM32F334x8)

/** @defgroup HRTIM HRTIM HAL module driver
  * @brief HRTIM HAL module driver
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup HRTIM_Private_Defines HRTIM Private Define
  * @{
  */
#define HRTIM_FLTR_FLTxEN (HRTIM_FLTR_FLT1EN |\
                           HRTIM_FLTR_FLT2EN |\
                           HRTIM_FLTR_FLT3EN |\
                           HRTIM_FLTR_FLT4EN | \
                           HRTIM_FLTR_FLT5EN)

#define HRTIM_TIMCR_TIMUPDATETRIGGER (HRTIM_TIMUPDATETRIGGER_MASTER  |\
                                      HRTIM_TIMUPDATETRIGGER_TIMER_A |\
                                      HRTIM_TIMUPDATETRIGGER_TIMER_B |\
                                      HRTIM_TIMUPDATETRIGGER_TIMER_C |\
                                      HRTIM_TIMUPDATETRIGGER_TIMER_D |\
                                      HRTIM_TIMUPDATETRIGGER_TIMER_E)
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup HRTIM_Private_Variables HRTIM Private Variables
  * @{
  */
static uint32_t TimerIdxToTimerId[] = 
{
  HRTIM_TIMERID_TIMER_A,
  HRTIM_TIMERID_TIMER_B,
  HRTIM_TIMERID_TIMER_C,
  HRTIM_TIMERID_TIMER_D,
  HRTIM_TIMERID_TIMER_E,
  HRTIM_TIMERID_MASTER,
};
/**
  * @}
  */

